{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "RapeGang Rape RGRSexually Abusive Content",
    "1": "Hacking  Damage to computercomputer system etc",
    "2": "Report Unlawful Content",
    "3": "Online Financial Fraud",
    "4": "Cyber Terrorism",
    "5": "Online Gambling  Betting",
    "6": "Crime Against Women & Children",
    "7": "Ransomware",
    "8": "Online Cyber Trafficking",
    "9": "Sexually Explicit Act",
    "10": "Child Pornography CPChild Sexual Abuse Material CSAM",
    "11": "Sexually Obscene material",
    "12": "Any Other Cyber Crime",
    "13": "Cyber Attack/ Dependent Crimes",
    "14": "Cryptocurrency Crime",
    "15": "Online and Social Media Related Crime"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Any Other Cyber Crime": 12,
    "Child Pornography CPChild Sexual Abuse Material CSAM": 10,
    "Crime Against Women & Children": 6,
    "Cryptocurrency Crime": 14,
    "Cyber Attack/ Dependent Crimes": 13,
    "Cyber Terrorism": 4,
    "Hacking  Damage to computercomputer system etc": 1,
    "Online Cyber Trafficking": 8,
    "Online Financial Fraud": 3,
    "Online Gambling  Betting": 5,
    "Online and Social Media Related Crime": 15,
    "Ransomware": 7,
    "RapeGang Rape RGRSexually Abusive Content": 0,
    "Report Unlawful Content": 2,
    "Sexually Explicit Act": 9,
    "Sexually Obscene material": 11
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.46.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
